rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "The Room"], ["rating", "PG"], ["description", ""], ["director", "Tommy Wiseau"], ["created_at", "2018-10-05 21:21:37.832787"], ["updated_at", "2018-10-05 21:21:37.832787"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'asdefef'
---
  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director && director.empty? then
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(director: director)